%%%%%%%%%%%%%%%%%%5

%计算一个 游走模型的标量系统
%   x(k+1)=x(k)+w(k)
%   z(k)=x(k)+v(k)
%   w(k)~(0,9)
%   v(k)~(0,4)

%求解滤波增益的稳态值

%%%%%%%%%%%%%%%%%%%

%   A表示过程矩阵，状态变换矩阵 
%   C表示测量矩阵
%   I表示可以设置的循环次数
%   z（k）表示当前测量值
%   p0表示估计方差的初值
%   pp1表示向前一步的递推状态估计方差
%   w(k)表示过程噪声，表示x（k）变成x（k+1）的不确定度
%   R(k)表示测量噪声方差
%   Q表示过程噪声方差

function [pp1,pp,KK]=kalmanfun(A,C,Q,R,I,p0)

p=p0*ones(size(A));
pp1=[]; pp=[]; KK=[];

for i=1:I
    p1=A*p*A'+Q;  %p1表示向前一步的递推状态估计方差
    K=p1*C'*inv(C'*p1*C+R);
    p=(eye(size(A))-K*C)*p1;
    pp1=[pp1 diag(p1)];
    
    pp=[pp diag(p)];
    KK=[KK K];
end
    




















