%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% 功能说明：Kalman滤波在船舶GPS导航方面的应用


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
clc;
clear all;
close all;
T=1;                                     %雷达的扫描周期
N=80/T;                                  %总的采样次数
X=zeros(4,N);                            %目标的真实位置和速度
X(:,1)=[-100,2,200,20];                  %目标的初始位置和速度
Z=zeros(2,N);                            %传感器对位置的观测
Z(:,1)=[X(1,1),X(3,1)];                  %船舶的初始位置
delta_w=1e-2; 


Q=delta_w*diag([0.5*T^2,1*T,0.5*T^2,1*T]);           %过程噪声方差
W=sqrtm(Q)*randn(4,N);

R=100*eye(2);                            %测量噪声均值
V=sqrtm(R)*randn(2,N);

F=[1,T,0,0;0,1,0,0;0,0,1,T;0,0,0,1];     %状态转移矩阵
H=[1,0,0,0;0,0,1,0];                     %观测矩阵

Xkf=zeros(4,N);
Xkf(:,1)=X(:,1);     %Kalman滤波器初始化      
P0=eye(4);           %滤波误差协方差矩阵

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for k=2:N
     
    %第一步：目标的真实轨迹
    X(:,k)=F*X(:,k-1)+W(k-1);
    
    %第二步：随着时间的推移获得实时的测量数据
    Z(:,k)=H*X(:,k)+V(k);

  
    %第三步：Kalman滤波，代入公式
    X_pre=F*Xkf(:,k-1);              %状态预测
    P_pre=F*P0*F'+Q;                 %协方差预测
    Kg=P_pre*H'*inv(H*P_pre*H'+R);   %计算卡尔曼增益
    e=Z(:,k)-H*X_pre;                %新息
    Xkf(:,k)=X_pre+Kg*e;             %状态更新
    P0=(eye(4)-Kg*H)*P_pre;          %协方差更新 
    
end
  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%计算误差
E_Messure=zeros(1,N);  %计算测量值和真实值之间的偏差
E_Kalman=zeros(1,N);   %记录Kalman估计值和真实值之差

for k=1:N
    E_Messure(k)=RMS(X(:,k),Z(:,k));   %滤波前的误差
    E_Kalman(k)=RMS(X(:,k),Xkf(:,k));   %滤波后的误差
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%    
%画图显示结果

figure
hold on;box on;
plot(X(1,:),X(3,:),'-K.');  %真实的轨迹
plot(Z(1,:),Z(2,:),'-bo');  %观测到的轨迹
plot(Xkf(1,:),Xkf(3,:),'-r*');  %滤波后的轨迹

legend('真实轨迹','观测轨迹','滤波后轨迹');

 xlabel('横坐标 X/m');
 ylabel('纵坐标 Y/m');
 
 %误差图分析
 figure
hold on;box on;
plot(E_Messure,'-ko','Markerface','g')
plot(E_Kalman,'-ks','Markerface','r')
legend('滤波前误差','滤波后误差')
 xlabel('采样时间');
 ylabel('误差值'); 
